app/controllers/school_classes_controller.rb

    def update
        @school_class = SchoolClass.find_by_id(params[:id])
        @school_class.update(school_class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 211], ["updated_at", "2019-12-14 04:33:47.312040"], ["id", 1]]